apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_rtc.c
struct esp32s2_rtc_priv_s
{
  uint32_t ck8m_wait : 8;          /* Number of rtc_fast_clk cycles to wait
                                    * for 8M clock to be ready */
  uint32_t xtal_wait : 8;          /* Number of rtc_fast_clk cycles to wait
                                    * for XTAL clock to be ready */
  uint32_t pll_wait : 8;           /* Number of rtc_fast_clk cycles to wait
                                    * for PLL to be ready */
  uint32_t clkctl_init : 1;        /* Perform clock control related
                                    * initialization */
  uint32_t pwrctl_init : 1;        /* Perform power control related
                                    * initialization */
  uint32_t rtc_dboost_fpd : 1;     /* Force power down RTC_DBOOST */
  uint32_t xtal_fpu : 1;
  uint32_t bbpll_fpu : 1;
  uint32_t cpu_waiti_clk_gate : 1;
  uint32_t cali_ocode : 1;         /* Calibrate Ocode to make bangap voltage
                                    * more precise. */
};

/* sleep configuration for rtc_sleep_init function */

struct esp32s2_rtc_sleep_config_s
{
  uint32_t lslp_mem_inf_fpu : 1;       /* Force normal voltage in sleep mode
                                        * (digital domain memory) */
  uint32_t rtc_mem_inf_follow_cpu : 1; /* Keep low voltage in sleep mode
                                        * (even if ULP/touch is used) */
  uint32_t rtc_fastmem_pd_en : 1;      /* Power down RTC fast memory */
  uint32_t rtc_slowmem_pd_en : 1;      /* Power down RTC slow memory */
  uint32_t rtc_peri_pd_en : 1;         /* Power down RTC peripherals */
  uint32_t wifi_pd_en : 1;             /* Power down WiFi */
  uint32_t int_8m_pd_en : 1;           /* Power down Internal 8M oscillator */
  uint32_t deep_slp : 1;               /* Power down digital domain */
  uint32_t wdt_flashboot_mod_en : 1;   /* Enable WDT flashboot mode */
  uint32_t dig_dbias_wak : 3;          /* Set bias for digital domain,
                                        * in active mode */
  uint32_t dig_dbias_slp : 3;          /* Set bias for digital domain,
                                        * in sleep mode */
  uint32_t rtc_dbias_wak : 3;          /* Set bias for RTC domain,
                                        * in active mode */
  uint32_t rtc_dbias_slp : 3;          /* Set bias for RTC domain,
                                        * in sleep mode */
  uint32_t bias_sleep_monitor : 1;     /* Circuit control parameter,
                                        * in monitor mode */
  uint32_t dbg_atten_slp : 4;          /* Voltage parameter, in sleep mode */
  uint32_t bias_sleep_slp : 1;         /* Circuit control parameter,
                                        * in sleep mode */
  uint32_t pd_cur_monitor : 1;         /* Circuit control parameter,
                                        * in monitor mode */
  uint32_t pd_cur_slp : 1;             /* Circuit control parameter,
                                        * in sleep mode */
  uint32_t vddsdio_pd_en : 1;          /* Power down VDDSDIO regulator */
  uint32_t xtal_fpu : 1;               /* Keep main XTAL powered up in
                                        * sleep */
  uint32_t rtc_regulator_fpu  : 1;     /* Keep rtc regulator powered up
                                        * in sleep */
  uint32_t deep_slp_reject : 1;        /* Enable deep sleep reject */
  uint32_t light_slp_reject : 1;       /* Enable light sleep reject */
};

/* Power down flags for rtc_sleep_pd function */

struct esp32s2_rtc_sleep_pd_config_s
{
  uint32_t dig_fpu : 1;    /* Set to 1 to power down digital part in sleep */
  uint32_t rtc_fpu : 1;    /* Set to 1 to power down RTC memories in sleep */
  uint32_t cpu_fpu : 1;    /* Set to 1 to power down digital memories
                            * and CPU in sleep */
  uint32_t i2s_fpu : 1;    /* Set to 1 to power down I2S in sleep */
  uint32_t bb_fpu : 1;     /* Set to 1 to power down Wi-Fi in sleep */
  uint32_t nrx_fpu : 1;    /* Set to 1 to power down Wi-Fi in sleep */
  uint32_t fe_fpu : 1;     /* Set to 1 to power down Wi-Fi in sleep */
};

#ifdef CONFIG_RTC_ALARM
struct alm_cbinfo_s
{
  struct rt_timer_s *alarm_hdl;  /* Timer id point to here */
  volatile alm_callback_t ac_cb; /* Client callback function */
  volatile void *ac_arg;         /* Argument to pass with the
                                  * callback function */
  uint64_t deadline_us;
  uint8_t index;
};
#endif

/* crystal configuration */

struct esp32s2_rtc_x32k_config_s
{
  uint32_t dac : 6;
  uint32_t dres : 3;
  uint32_t dgm : 3;
  uint32_t dbuf: 1;
};

struct esp32s2_rtc_backup_s
{
  uint64_t magic;
  int64_t  offset;              /* Offset time from RTC HW value */
  int64_t  reserved0;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* APB Frequency */

static uint32_t g_apb_freq;

/* Callback to use when the alarm expires */

#ifdef CONFIG_RTC_ALARM
static struct alm_cbinfo_s g_alarmcb[RTC_ALARM_LAST];
#endif

static RTC_DATA_ATTR struct esp32s2_rtc_backup_s rtc_saved_data;

/* Saved data for persistent RTC time */

static struct esp32s2_rtc_backup_s *g_rtc_save;
static bool g_rt_timer_enabled = false;
static spinlock_t g_rtc_lock = SP_UNLOCKED;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void IRAM_ATTR esp32s2_rtc_sleep_pd(
                      struct esp32s2_rtc_sleep_pd_config_s cfg);
static inline bool esp32s2_clk_val_is_valid(uint32_t val);
static void IRAM_ATTR esp32s2_rtc_clk_fast_freq_set(
                      enum esp32s2_rtc_fast_freq_e fast_freq);
static uint32_t IRAM_ATTR esp32s2_rtc_clk_cal_internal(
                enum esp32s2_rtc_cal_sel_e cal_clk,
                uint32_t slowclk_cycles);
static int  IRAM_ATTR esp32s2_rtc_clk_slow_freq_get(void);
static void IRAM_ATTR esp32s2_rtc_clk_slow_freq_set(
                      enum esp32s2_rtc_slow_freq_e slow_freq);
static void esp32s2_select_rtc_slow_clk(enum esp32s2_slow_clk_sel_e
                                        slow_clk);
static void esp32s2_rtc_clk_32k_enable(bool enable);
static void IRAM_ATTR esp32s2_rtc_clk_8m_enable(bool clk_8m_en,
                                                bool d256_en);
static void esp32s2_rtc_calibrate_ocode(void);
static void IRAM_ATTR esp32s2_rtc_clk_bbpll_disable(void);
static void IRAM_ATTR esp32s2_rtc_bbpll_configure(
                     enum esp32s2_rtc_xtal_freq_e xtal_freq, int pll_freq);
static void IRAM_ATTR esp32s2_rtc_clk_cpu_freq_to_8m(void);
static void IRAM_ATTR esp32s2_rtc_clk_cpu_freq_to_pll_mhz(int cpu_freq_mhz);

void IRAM_ATTR esp32s2_rtc_bbpll_disable(void);
void esp32s2_rtc_clk_apb_freq_update(uint32_t apb_freq);
void IRAM_ATTR esp32s2_rtc_update_to_xtal(int freq, int div);
static void esp32s2_wait_dig_dbias_valid(uint64_t rtc_cycles);
uint32_t esp32s2_rtc_clk_apb_freq_get(void);

#ifdef CONFIG_RTC_ALARM
static void IRAM_ATTR esp32s2_rt_cb_handler(void *arg);
#endif
/****************************************************************************
 * Public Data
 ****************************************************************************/

volatile bool g_rtc_enabled = false;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/* Set the real CPU ticks per us to the ets, so that ets_delay_us
 * will be accurate. Call this function when CPU frequency is changed.
 */

extern void ets_update_cpu_frequency(uint32_t ticks_per_us);

/****************************************************************************
 * Name: esp32s2_rtc_sleep_pd
 *
 * Description:
 *   Configure whether certain peripherals are powered up in deep sleep.
 *
 * Input Parameters:
 *   cfg - power down flags as rtc_sleep_pu_config_t structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR
        esp32s2_rtc_sleep_pd(struct esp32s2_rtc_sleep_pd_config_s cfg)
{
  REG_SET_FIELD(RTC_CNTL_DIG_PWC_REG,
                RTC_CNTL_LSLP_MEM_FORCE_PU, cfg.dig_fpu);
  REG_SET_FIELD(RTC_CNTL_PWC_REG,
                RTC_CNTL_FASTMEM_FORCE_LPU, cfg.rtc_fpu);
  REG_SET_FIELD(RTC_CNTL_PWC_REG,
                RTC_CNTL_SLOWMEM_FORCE_LPU, cfg.rtc_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_DC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_PBUS_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(SYSCON_FRONT_END_MEM_PD_REG,
                SYSCON_AGC_MEM_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_FFT_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(BBPD_CTRL, BB_DC_EST_FORCE_PU, cfg.bb_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_RX_ROT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_VIT_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(NRXPD_CTRL, NRX_DEMAP_FORCE_PU, cfg.nrx_fpu);
  REG_SET_FIELD(FE_GEN_CTRL, FE_IQ_EST_FORCE_PU, cfg.fe_fpu);
  REG_SET_FIELD(FE2_TX_INTERP_CTRL, FE2_TX_INF_FORCE_PU, cfg.fe_fpu);
}

/****************************************************************************
 * Name: esp32s2_rtc_clk_fast_freq_set
 *
 * Description:
 *   Select source for RTC_FAST_CLK.
 *
 * Input Parameters:
 *   fast_freq - Clock source (one of enum esp32s2_rtc_fast_freq_e values)
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR esp32s2_rtc_clk_fast_freq_set(
                      enum esp32s2_rtc_fast_freq_e fast_freq)
{
  REG_SET_FIELD(RTC_CNTL_CLK_CONF_REG, RTC_CNTL_FAST_CLK_RTC_SEL,
                fast_freq);
  up_udelay(DELAY_FAST_CLK_SWITCH);
}

/****************************************************************************
 * Name: esp32s2_clk_val_is_valid
 *
 * Description:
 *   Values of RTC_XTAL_FREQ_REG and RTC_APB_FREQ_REG are
 *   stored as two copies in lower and upper 16-bit halves.
 *   These are the routines to work with such a representation.
 *
 * Input Parameters:
 *   val - register value
 *
 * Returned Value:
 *   true:  Valid register value.
 *   false: Invalid register value.
 *
 ****************************************************************************/

static inline bool esp32s2_clk_val_is_valid(uint32_t val)
{
  return (val & 0xffff) == ((val >> 16) & 0xffff)
                        && val != 0 && val != UINT32_MAX;
}

/****************************************************************************
 * Name: esp32s2_rtc_clk_cal_internal
 *
 * Description:
 *   Clock calibration function used by rtc_clk_cal and rtc_clk_cal_ratio
 *
 * Input Parameters:
 *   cal_clk        - which clock to calibrate
 *   slowclk_cycles - number of slow clock cycles to count.
 *
 * Returned Value:
 *   Number of XTAL clock cycles within the given number of slow clock
 *   cycles.
 *   In case of error, return 0 cycle.
 *
 ****************************************************************************/

